Revit 2026 API

# IFCPropertyMappingInfo(Boolean, String, ElementId, String) Constructor

---

Constructs a new IFCPropertyMappingInfo with input values. The flag that indicates whether the property is included in export. The property name. The Revit property id. The Revit property id.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public IFCPropertyMappingInfo(
	bool exportFlag,
	string ifcPropertyName,
	ElementId revitPropertyId,
	string revitPropertyName
)
```
```vb
Public Sub New (
	exportFlag As Boolean,
	ifcPropertyName As String,
	revitPropertyId As ElementId,
	revitPropertyName As String
)
```
```cpp
public:
IFCPropertyMappingInfo(
	bool exportFlag,
	String^ ifcPropertyName,
	ElementId^ revitPropertyId,
	String^ revitPropertyName
)
```
```fsharp
new :
        exportFlag : bool *
        ifcPropertyName : string *
        revitPropertyId : ElementId *
        revitPropertyName : string -> IFCPropertyMappingInfo
```

#### Parameters

exportFlag Boolean

ifcPropertyName String

revitPropertyId ElementId

revitPropertyName String

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

IFCPropertyMappingInfo Class

IFCPropertyMappingInfo Overload

Autodesk.Revit.DB Namespace